#include "ui.h"

/***********************************************
 * 功能：
 *      打印程序刚运行时的UI
 * 参数：
 *      void
 * 返回：
 *      void
 ***********************************************/
void welcome_init(void)
{
    system("clear");
    printf(
        "***********************\n"
        "* 欢迎来到员工管理系统\n"
        "* 1. 登录\n"
        "* 2. 注册\n"
        "* 0. 退出\n"
        "***********************\n\n"
    );
}

/***********************************************
 * 功能：
 *      管理员登录成功后展示其UI
 * 参数：
 *      name：在UI上打印管理员名表示欢迎
 * 返回：
 *      void
 ***********************************************/
void welcome_root(const char name[])
{
    system("clear");
    printf(
        "***********************\n"
        "* 欢迎 %s !\n"
        "* 1. 增加新员工\n"
        "* 2. 删除员工\n"
        "* 3. 修改员工信息\n"
        "* 4. 查询员工信息\n"
        "* 5. 查询员工的详细的访问记录\n"
        "* 6. 查看所有员工信息\n"
        "* 0. 登出\n"
        "***********************\n\n"
    , name);
}

/***********************************************
 * 功能：
 *      普通用户登录成功后展示其UI
 * 参数：
 *      name：在UI上打印普通用户名表示欢迎
 * 返回：
 *      void
 ***********************************************/
void welcome_normal(const char name[])
{
    system("clear");
    printf(
        "***********************\n"
        "* 欢迎 %s !\n"
        "* 1. 修改自己的信息\n"
        "* 2. 查询自己的信息\n"
        "* 3. 查询自己的详细的访问记录\n"
        "* 4. 查询其他员工信息(部分信息被隐藏)\n"
        "* 5. 查看所有员工信息(部分信息被隐藏)\n"
        "* 0. 登出\n"
        "***********************\n\n"
    , name);
}